In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("titanic.csv")

In [3]:
data.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [4]:
data = data[['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Survived','Ticket','Cabin','Embarked']]
data.head()

,Pclass,Sex,Age,SibSp,Parch,Fare,Survived,Ticket,Cabin,Embarked
0,3,male,22.0,1,0,7.2500,0,A/5 21171,NaN,S
1,1,female,38.0,1,0,71.2833,1,PC 17599,C85,C
2,3,female,26.0,0,0,7.9250,1,STON/O2. 3101282,NaN,S
3,1,female,35.0,1,0,53.1000,1,113803,C123,S
4,3,male,35.0,0,0,8.0500,0,373450,NaN,S

In [5]:
data = data[['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Survived','Fare','Cabin','Embarked']]
data.head()

   Pclass     Sex   Age  SibSp  Parch  Survived     Fare Cabin Embarked
0       3    male  22.0      1      0         0   7.2500   NaN        S
1       1  female  38.0      1      0         1  71.2833   C85        C
2       3  female  26.0      0      0         1   7.9250   NaN        S
3       1  female  35.0      1      0         1  53.1000  C123        S
4       3    male  35.0      0      0         0   8.0500   NaN        S

In [6]:
data = data[['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Survived','Fare','Cabin']]
data.head()

   Pclass     Sex   Age  SibSp  Parch  Survived     Fare Cabin
0       3    male  22.0      1      0         0   7.2500   NaN
1       1  female  38.0      1      0         1  71.2833   C85
2       3  female  26.0      0      0         1   7.9250   NaN
3       1  female  35.0      1      0         1  53.1000  C123
4       3    male  35.0      0      0         0   8.0500   NaN

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
Pclass      891 non-null int64
Sex         891 non-null object
Age         714 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Survived    891 non-null int64
Fare        891 non-null float64
Cabin       204 non-null object
dtypes: float64(2), int64(4), object(2)
memory usage: 55.8+ KB

In [8]:
data = data[['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Survived','Fare']]
data.head()

   Pclass     Sex   Age  SibSp  Parch  Survived     Fare
0       3    male  22.0      1      0         0   7.2500
1       1  female  38.0      1      0         1  71.2833
2       3  female  26.0      0      0         1   7.9250
3       1  female  35.0      1      0         1  53.1000
4       3    male  35.0      0      0         0   8.0500

In [9]:
data = data[['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Survived']]
data.head(15)

    Pclass     Sex   Age  SibSp  Parch  Survived
0        3    male  22.0      1      0         0
1        1  female  38.0      1      0         1
2        3  female  26.0      0      0         1
3        1  female  35.0      1      0         1
4        3    male  35.0      0      0         0
5        3    male   NaN      0      0         0
6        1    male  54.0      0      0         0
7        3    male   2.0      3      1         0
8        3  female  27.0      0      2         1
9        2  female  14.0      1      0         1
10       3  female   4.0      1      1         1
11       1  female  58.0      0      0         1
12       3    male  20.0      0      0         0
13       3    male  39.0      1      5         0
14       3  female  14.0      0      0         0

In [10]:
data["Age"].fillna(data["Age"].mean(), inplace=True)
data.head(15)

    Pclass     Sex        Age  SibSp  Parch  Survived
0        3    male  22.000000      1      0         0
1        1  female  38.000000      1      0         1
2        3  female  26.000000      0      0         1
3        1  female  35.000000      1      0         1
4        3    male  35.000000      0      0         0
5        3    male  29.699118      0      0         0
6        1    male  54.000000      0      0         0
7        3    male   2.000000      3      1         0
8        3  female  27.000000      0      2         1
9        2  female  14.000000      1      0         1
10       3  female   4.000000      1      1         1
11       1  female  58.000000      0      0         1
12       3    male  20.000000      0      0         0
13       3    male  39.000000      1      5         0
14       3  female  14.000000      0      0         0

In [11]:
data['Sex'] = data['Sex'].map({'male': 0, 'female': 1})
data.head(15)

    Pclass  Sex        Age  SibSp  Parch  Survived
0        3    0  22.000000      1      0         0
1        1    1  38.000000      1      0         1
2        3    1  26.000000      0      0         1
3        1    1  35.000000      1      0         1
4        3    0  35.000000      0      0         0
5        3    0  29.699118      0      0         0
6        1    0  54.000000      0      0         0
7        3    0   2.000000      3      1         0
8        3    1  27.000000      0      2         1
9        2    1  14.000000      1      0         1
10       3    1   4.000000      1      1         1
11       1    1  58.000000      0      0         1
12       3    0  20.000000      0      0         0
13       3    0  39.000000      1      5         0
14       3    1  14.000000      0      0         0

In [12]:
data.to_csv('cleansed.csv', sep=',')